In [2]:
#Questions 1:
#How to import pandas and check the version?
import pandas as pd
print(pd.__version__)

1.1.4

In [7]:
#Questions 2:
#How to create a series from a numpy array?

import numpy as np

a = np.arange(10,100,10)
print('array:',a)

b = pd.Series(a)
print('Series:\n',b)

array: [10 20 30 40 50 60 70 80 90]
Series:
 0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [ ]:
#Questions 3:
#How to convert the index of a series into a column of a dataframe?

In [8]:
df = pd.DataFrame({'Roll Number': ['20CSE29', '20CSE49', '20CSE36', '20CSE44'], 
                   'Name': ['Amelia', 'Sam', 'Dean', 'Jessica'], 
                   'Marks In Percentage': [97, 90, 70, 82], 
                   'Grade': ['A', 'A', 'C', 'B'], 
                   'Subject': ['Physics', 'Physics', 'Physics', 'Physics']}) 
df

  Roll Number     Name  Marks In Percentage Grade  Subject
0     20CSE29   Amelia                   97     A  Physics
1     20CSE49      Sam                   90     A  Physics
2     20CSE36     Dean                   70     C  Physics
3     20CSE44  Jessica                   82     B  Physics

In [9]:
df.reset_index(level=0, inplace=True) 
df

   index Roll Number     Name  Marks In Percentage Grade  Subject
0      0     20CSE29   Amelia                   97     A  Physics
1      1     20CSE49      Sam                   90     A  Physics
2      2     20CSE36     Dean                   70     C  Physics
3      3     20CSE44  Jessica                   82     B  Physics

In [12]:
#Questions 4:
#Write the code to list all the datasets available in seaborn library.
#Load the 'mpg' dataset

#Note: mpg dataset will be read from seaborn module in the manner sir has already shown(provided in the
#materials folder)
import seaborn as sns
print(sns.__version__)

0.11.0

In [15]:
mpg = sns.load_dataset('mpg')

In [17]:
mpg.head()

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst
4  17.0          8         302.0  ...          70     usa                ford torino

[5 rows x 9 columns]

In [18]:
mpg.shape

(398, 9)

In [27]:
#Questions 5:
#Which country origin cars are a part of this dataset?
mpg['origin'].unique()

array(['usa', 'japan', 'europe'], dtype=object)

In [31]:
#Questions 6:
#Extract the part of the dataframe which contains cars belonging to 'usa'
mpg_usa = mpg[mpg['origin'].str.contains('usa')]
mpg_usa

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
392  27.0          4  ...     usa           chevrolet camaro
393  27.0          4  ...     usa            ford mustang gl
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[249 rows x 9 columns]

In [32]:
mpg_usa['origin'].unique()

array(['usa'], dtype=object)